Answer.md.
проблемы с исходным файлом:
для проведения анализа по дз, все необходимые данные были в табице и особо не было проблем.
однако, в некоторых стобцах есть следующие недочеты:
1. разные форматы ячеек - затрудняет работу с файлом
что сделать: привести ячеки к единому формату 
2. в некторых столбцах есть пустые поля, что не позволяет сделать качественный анализ
при анализе с неизвестными значениямми необходимо выделить отдельную группу "неизвестые" 

Шансы на выживание:
Леонардо Ди Каприо - 13,87%
Кейт Уинслет - 96,81%
Query - =QUERY(train!$A$2:$L$892;"select count(B) where B=1 and E='female'") - 233 результат 
Результат - 233
ссылка на google sheets: https://docs.google.com/spreadsheets/d/19dHJcRNAtAv88WhgrAi22N-Hq_-GAZpBKYUDu-nSHys/edit?usp=sharing
